"""
从控制台输入一个三位数，如果是水仙花数就打印“是水仙花数”
否则打印“不是水仙花数”
# 153 = 1^3 + 5^3 + 3^3
"""
num0 = int(input("请输入一个三位数："))
a = num0 // 100
b = (num0 - (a * 100)) // 10
c = (num0 - (a * 100) - (b * 10))
print(a, b, c)
if num0 == (a ** 3) + (b ** 3) + (c ** 3):
    print("是水仙花数")
else:
    print("不是水仙花数")
'''
a = 123456
print(a % 10)  # 6
print((a // 10) % 10)  # 5
print((a // 100) % 10)  # 4
print((a // 1000) % 10)  # 3
print((a // 10000) % 10)  # 2
print(a // 100000)  # 1
'''

"""
从控制台输入一个五位数，如果是回文数就打印“是回文数”
否则打印“不是回文数”
11111   12321   12221
"""
num01 = int(input("请输入一个五位数："))
a01 = num01 // 10000
b01 = (num01 - (a01 * 10000)) // 1000
c01 = (num01 - (a01 * 10000) - (b01 * 1000)) // 100
d01 = (num01 - (a01 * 10000) - (b01 * 1000) - (c01 * 100)) // 10
e01 = (num01 - (a01 * 10000) - (b01 * 1000) - (c01 * 100) - (d01 * 10))
print(a01, b01, c01, d01, e01)
if num01 == (e01 * 10000) + (d01 * 1000) + (c01 * 100) +(b01 * 10) + a01:
    print("是回文数")
else:
    print("不是回文数")
'''
a = 123456
print(a % 10)  # 6
print((a // 10) % 10)  # 5
print((a // 100) % 10)  # 4
print((a // 1000) % 10)  # 3
print((a // 10000) % 10)  # 2
print(a // 100000)  # 1
'''

"""
不准使用max min
从控制台输入一个两个数，输出较大的值

从控制台输入一个三个数，输出较大的值
"""
'''
a = int(input("请输入第一个数："))
b = int(input("请输入第二个数："))
if a > b:
    print("最大数是：", a)
else:
    print("最大数是：", b)
'''
a = int(input("请输入第一个数："))
b = int(input("请输入第二个数："))
c = int(input("请输入第三个数："))

num = a
if b > num:
    num = b
if c > num:
    num = c
print("最大值：", num)
'''
if a > b:
    if a > c:
        print("最大数是：", a)
    else:
        print("最大数是：", c)
else:
    if b > c:
        print("最大数是：", b)
    else:
        print("最大数是：", c)
'''

# 从控制台输入一个年份，判断是否是闰年
# 能被4整除但是不能被100整除或能被400整除
year = int(input("请输入一个年份："))
if (year % 4 == 0 and year % 100 != 0) or year % 400 == 0:
    print("闰年")
else:
    print("不是闰年")

